harmonogram/harmonogram.tex
% Created 2023-03-16 Thu 18:26
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{placeholder}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={placeholder},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.0.50 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\begin{center}
\begin{tabular}{|l|l|}
\hline
\multicolumn{2}{|l|}{Politechnika Świętokrzyska w Kielcach} \\
\multicolumn{2}{|l|}{Wydział Elektrotechniki,Automatyki I Informatyki} \\
\hline
\multicolumn{2}{|l|}{Podstawy Programownaia 2 - Projekt} \\
\multicolumn{2}{|l|}{Informatyka - I Rok akademicki 2022/2023} \\
\hline
Temat Projektu: & Wykonali: \\
Wypożyczalnia Samochodów & 1. Rafał Grot \\
 & 2. Kamil Gunia \\
 & 3. Jakub Grzelec \\
 & 4. Karina Goszczyńska \\
\hline
\end{tabular}
\end{center}
\section{Pierwszy kamień milowy}
\label{sec:orgc3ea790}
\begin{enumerate}
\item Opanowanie systemu kotroli wersji \texttt{git}.
\item Podział pracy w zespole.
\item Projekt relacyjniej bazy danych samochodów, klientów, wypożyczeń.
\item Zapoznanie się z biblioteką \texttt{sqlite} \url{https://www.sqlite.org} ,nauka tworzenia i wykonwywania porstych kwerend za jej pomocą.
\item Wstępna implementacja interfejsu użytkownia.
\item Testowanie poprawności działąnia menu.
\item Przygotowanie przy użyciu sprawozdania z postępów prac nad projektem.
\end{enumerate}
\section{Drugi kamień milowy}
\label{sec:orgf850504}
\begin{enumerate}
\item Implementacja bazy danych.
\item Implementacja dodawania, usuwania oraz modyfikacji -- Samochodów i kilentów.
\item Implementacja wypożyczania i oddawania samochodów
\item Wyświetlanie samochodów z możliwością sortowania rosnącego/malejącego.
\end{enumerate}
\section{I termin}
\label{sec:org6ec6008}
\begin{enumerate}
\item Stworzenie dokumentacji w porgramie \texttt{Doxygen}
\item Sporządzenie sprawodzania.
\item Dodanie ewentualnych ulepszeń.
\end{enumerate}
\end{document}